app/controllers/employs_controller.rb

  def index
    @employs = Employ.all
---
SELECT "employs".* FROM "employs"

  def create
    @employ = Employ.new(employ_params)

    respond_to do |format|
      if @employ.save
---
INSERT INTO "employs" ("emp_name", "emp_father_name", "sallary", "designation", "starting_date", "mobile_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_employ
      @employ = Employ.find(params[:id])
---
SELECT  "employs".* FROM "employs" WHERE "employs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]