app/controllers/holders_controller.rb

SELECT "holders".* FROM "holders"
---
  def index
    @holders = Holder.all

INSERT INTO "holders" ("f", "father_nam", "tazkira_number", "mobile_number", "sex", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @holder = Holder.new(holder_params)

    respond_to do |format|
      if @holder.save

DELETE FROM "holders" WHERE "holders"."id" = ?  [["id", 1]]
---
  def destroy
    @holder.destroy

SELECT  "holders".* FROM "holders" WHERE "holders"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
    def set_holder
      @holder = Holder.find(params[:id])