app/controllers/items_controller.rb

  def create
    @item = Item.new(item_params)

    respond_to do |format|
      if @item.save
---
INSERT INTO "items" ("itm_name", "brand", "price", "category", "quantity", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["itm_name", "soap"], ["brand", "lux"], ["price", 45], ["category", "A"], ["quantity", "5"], ["created_at", "2018-03-25 18:24:17.111544"], ["updated_at", "2018-03-25 18:24:17.111544"]]

  def update
    respond_to do |format|
      if @item.update(item_params)
---
UPDATE "items" SET "image" = ?, "category" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["image", "f0437-001.jpg"], ["category", "A"], ["updated_at", "2018-04-09 16:51:08.562704"], ["id", 4]]